# -*- auto-fill-function: nil; line-spacing: 0.15; org-odd-levels-only: t; -*-
#+STARTUP: hidestars
#+TODO: TODO IN-PROGRESS | DONE
*** Suggestions: what should I buy/paint/play next?
      - BUY/PAINTING
        Buy is same as paint, just using a different variable
        Should suggest the scenario closest to completion
        Biased towards larger scenarios (because otherwise suggestion will always include Shelob)
           ((num_painted + 1) * 100 / (total_figures + 1)) * total_figures SORT DESC WHERE num_painted < total_figures
           |---------------+-------------+------------|
           | SCENARIO SIZE | NUM PAINTED | SORT ORDER |
           |---------------+-------------+------------|
           |             3 |           0 |         25 |
           |             3 |           1 |         50 |
           |             3 |           2 |         75 |
           |            20 |           0 |          4 |
           |            20 |           5 |         28 |
           |            20 |          17 |         85 |
           |            80 |           0 |          1 |
           |            80 |           5 |          7 |
           |            80 |          24 |         30 |
           |            80 |          62 |         77 |
           |            80 |          77 |         96 |
           |            80 |          79 |         98 |
           |---------------+-------------+------------|
           #+TBLFM: $3 = idiv(($2 + 1) * 100, ($1 + 1))
        THIS TELLS ME WHICH SCENARIO TO WORK TOWARDS BUT DOESN'T TELL ME EXACTLY WHICH FIGURES TO PAINT; MAYBE GOOD ENOUGH BUT MAYBE NOT....
        PROBABLY WANT TO AVOID DUPLICATE SCENARIO NAMES
      - PLAYING: not really possible until we track plays
g
